04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/VoFToFilm/0/film/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/film";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            fixedValue;
        value           $internalField;
    }

    surface
    {
        type            coupledTemperature;
        value           $internalField;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
}


// ************************************************************************* //
